# NetworkValidityErrorWasDisconnected Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..NetworkValidityErrorWasDisconnected Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkValidityErrorWasDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkValidityErrorWasDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkValidityErrorWasDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace